app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users"   ORDER BY "users"."email" ASC
---
  def index
    @users = User.order(:email)

INSERT INTO "users" ("created_at", "password_digest", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-07-19 23:37:58.622135"], ["password_digest", "$2a$04$PcA3MiATYjDGADOB9DiQCeDir0der/7vq.d9mYv4j6c/xCBwaVJbG"], ["updated_at", "2014-07-19 23:37:58.622135"]]
---
  def create
    params = user_params.dup
    params[:password_confirmation] = params[:password]
    @user = User.new(params)

    if @user.save