app/controllers/projects_controller.rb

INSERT INTO "projects" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-05-28 04:43:15.495324"], ["description", "A text editor for OS-X"], ["name", "TextMate 2"], ["updated_at", "2014-05-28 04:43:15.495324"]]
---
	def create
		@project = Project.new(project_params)
		if @project.save

UPDATE "projects" SET "description" = ?, "name" = ?, "updated_at" = ? WHERE "projects"."id" = 1  [["description", ""], ["name", "TextMate 2 beta"], ["updated_at", "2014-05-28 04:43:15.335321"]]
---
	def update
		if @project.update(project_params)