app/controllers/sessions_controller.rb

	def create
		user = User.where(:name => params[:signin][:name]).first
---
SELECT  "users".* FROM "users"  WHERE "users"."name" = 'username'  ORDER BY "users"."id" ASC LIMIT 1