app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-05-28 04:43:15.750927"], ["name", ""], ["password_digest", "$2a$04$.QLsIlkfpwC.FgQ5PlqWs.MBT2us1xeooz9GJX6AjaviWVgHvMdwO"], ["updated_at", "2014-05-28 04:43:15.750927"]]
---
  def create
  	@user = User.new(user_params)

  	if @user.save